_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 18, 64)            61504     
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 16, 64)            12352     
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 1, 64)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 1, 320)            20800     
=================================================================
Total params: 94,656
Trainable params: 94,656
Non-trainable params: 0
_________________________________________________________________


-----------------------------------------------------------------------------------

Patience: 10
Epochs: 25
Train score: 0.0
Test score: 0.0
Execution time: 5.51
