_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 18, 78, 32)        34592     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 16, 76, 32)        9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 8, 38, 32)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 9728)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 9600)              93398400  
=================================================================
Total params: 93,442,240
Trainable params: 93,442,240
Non-trainable params: 0
_________________________________________________________________


-----------------------------------------------------------------------------------

Patience: 10
Epochs: 12
Train score: 0.05
Test score: 7.46
Execution time: 570.2
