_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
time_distributed_1 (TimeDist (None, 20, 78, 118, 32)   320       
_________________________________________________________________
time_distributed_2 (TimeDist (None, 20, 39, 59, 32)    0         
_________________________________________________________________
time_distributed_3 (TimeDist (None, 20, 73632)         0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 25)                7365800   
_________________________________________________________________
dense_1 (Dense)              (None, 9600)              249600    
=================================================================
Total params: 7,615,720
Trainable params: 7,615,720
Non-trainable params: 0
_________________________________________________________________


-----------------------------------------------------------------------------------

Patience: 10
Epochs: 200
Train score: 5.66
Test score: 5.73
Execution time: 6345.82
